
var express = require('express');
var app = express();

var calendarData = {
    '2017-12-1': {
        "chineseDate": '十月十四',
        "title": '导演 伍迪·艾伦',
        "time": '（1935.12.1 - ）',
        "comment": '我觉得生活有两种：痛苦的生活与悲惨的生活。让我感到惊异的是，所有的其他人都过着悲惨的生活。所以，你应该对悲惨的生活感恩，因为过着悲惨的生活，其实试衣间十足的幸事。',
        "from": '',
        "movie": '安妮·霍尔',
        "average": '8.5',
        "stars": 4.5
    },
    '2017-12-2': {
        "chineseDate": '十月十五',
        "title": '废除奴隶制国际日',
        "time": '1949年12月2日',
        "comment": '昆汀的粗暴永远令人着迷，时常带着些怪痞的幽默，混搭风格贯穿其中，枪战场面与配乐完美搭配，乐在其中。',
        "from": 'zzy花岗岩',
        "movie": '被解救的姜戈',
        "average": '8.5',
        "stars": 4.5
    },
    '2017-12-3': {
        "chineseDate": '十月十六',
        "title": '世界残疾人日',
        "time": '每年12月3日',
        "comment": '每个人至少有这么一个挚友，你们在人生的拐点遇到，惊叹于彼此的不同或者相似，有过不少平淡无奇却值得纪念的时光，ta会将心比心，为你的爱上扼腕，为你的快慰击节，更会在ta的心里，为你留下那么一块永恒的位置，任白云苍狗，风云变幻。',
        "from": 'LORENZO',
        "movie": '触不可及',
        "average": '9.1',
        "stars": 4.5
    },
    '2017-12-4': {
        "chineseDate": '十月十七',
        "title": '苏联绘制出第一张太空地图',
        "time": '1986年12月4日',
        "comment": '不要把科学问题当做爱情问题。塔可夫斯基和库布里克，一个是饱含了对全人类的爱。一个是完全没有进入人类情感的世界里头。',
        "from": '木卫二',
        "movie": '飞向太空',
        "average": '8.4',
        "stars": 4.5
    },
    '2017-12-5': {
        "chineseDate": '十月十八',
        "title": '《心灵捕手》上映20周年',
        "time": '（1997.12.5 - 2017.12.5 ）',
        "comment": '你不了解真正的失去，唯有爱别人胜于自己才能体会。',
        "from": '',
        "movie": '心灵捕手',
        "average": '8.7',
        "stars": 4.5
    },
    '2017-12-6': {
        "chineseDate": '十月十九',
        "title": '作曲家 久石让',
        "time": '（1950.12.6 - ）',
        "comment": '我们的孤独就像天空中漂浮的城市，仿佛是一个秘密，却无从诉说。',
        "from": '',
        "movie": '天空之城',
        "average": '9.0',
        "stars": 4.5
    },
    '2017-12-7': {
        "chineseDate": '十月二十',
        "title": '国际民航日',
        "time": '每年12月7日',
        "comment": '你宝贵的时光在虚空中渡过。积攒着毫无意义、冰冷孤寂的里程。在云端的日子，看似逍遥曼妙，无所束缚。但骨子飞行，即使飞过了一千万里，依旧是“生命中不可承受之轻”，总有一天，双脚还要落回坚实的土地。',
        "from": '匡匡',
        "movie": '在云端',
        "average": '7.9',
        "stars": 4.0
    },
    '2017-12-8': {
        "chineseDate": '十月二十一',
        "title": '眼滚音乐家 约翰·列侬',
        "time": '（1940.10.9 - 1980.12.8）',
        "comment": '我很想经历那个时代，音乐可以很伟大，甚至成为信仰，我记住了呼吁着和平的列侬，我记住了那首《give peace a chance》',
        "from": '玛丽隔壁',
        "movie": '约翰·列侬的理想世界',
        "average": '9.0',
        "stars": 4.5
    },
    '2017-12-9': {
        "chineseDate": '十月二十二',
        "title": '国际反腐败日',
        "time": '每年12月9日',
        "comment": '一黑到底的批判现实电影，用危楼映射俄罗斯的烂根。辅修的官员和麻木的民众，让人看不到一丝希望，生冷的让人恐惧。有的人活着，他已经死了。有的楼还在，它已经塌了。',
        "from": '猫叔Mack',
        "movie": '危楼愚夫',
        "average": '8.5',
        "stars": 4.5
    },
    '2017-12-10': {
        "chineseDate": '十月二十三',
        "title": '联合国大会通过《世界人权宣言》',
        "time": '1948年2月10日',
        "comment": '两条线，两个男人，两个故事，两个相互打捞的故事。丢了一个，批次的人生都会沉入海底......就像哈代所言，呼唤的人与被呼唤的很少能互相答应。他们最终选择了沉默的相互记录。',
        "from": 'sogdiana',
        "movie": '窃听风暴',
        "average": '9.1',
        "stars": 4.5
    }
}


app.get('/', function(req, res) {
    res.send(calendarData[req.query.date]);
});

var port = process.env.PORT || 5000;
app.listen(port, function(){
    console.log( 'Express started on http://localhost:' + port + '; 按Ctrl-C退出。' );
});